Конфигурация/Documents/ПереоценкаМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереоценкаМНО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоцениватьНаОснованииНастроекУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МНО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МНО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СделкаСМО</v8:Type>
								<v8:Type>cfg:DocumentRef.МНО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценочнаяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/БазаДляНачисленияПроцентовНаОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>БазаДляНачисленияПроцентовНаОстаткиДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СреднемесячныйОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическийЕжедневныйОстаток</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПереоценкаМНО/Ext/ManagerModule.bsl
Функция ОпределитьУчетныйАктив(Документ, ВидУчета) Экспорт
	
	Перем УчетныйАктив;	
	
	УчетныеАктивы = ?(ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, Справочники.УчетныеАктивыЕПС, Справочники.УчетныеАктивы);
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.МНО") Тогда
		УчетныйАктив = УчетныеАктивы.ПроцентыНаМНО;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СделкаСМО") Тогда
		БазаДляНачисленияПроцентов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "БазаДляНачисленияПроцентов");
		Если БазаДляНачисленияПроцентов = Перечисления.БазаДляНачисленияПроцентовНаОстаткиДенежныхСредств.СреднемесячныйОстаток Тогда
			УчетныйАктив = УчетныеАктивы.ПроцентыНаСМО;		
		ИначеЕсли БазаДляНачисленияПроцентов = Перечисления.БазаДляНачисленияПроцентовНаОстаткиДенежныхСредств.ФактическийЕжедневныйОстаток Тогда
			УчетныйАктив = УчетныеАктивы.ПроцентыНаФЕО;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат УчетныйАктив;
	
КонецФункции

Функция ПолучитьСчетаУчетаПереоценки(Организация, СчетДоверительногоУправления, ВидУчета, ДатаПереоценки, Отказ) Экспорт
	
	УчетныеАктивы = ?(ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, Справочники.УчетныеАктивыЕПС, Справочники.УчетныеАктивы);	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПереоценки, Организация, СчетДоверительногоУправления);
	
	СчетаУчетаПереоценки = Новый ТаблицаЗначений;
	СчетаУчетаПереоценки.Колонки.Добавить("УчетныйАктив", Новый ОписаниеТипов(РаботаСКоллекциями.ЗначениеВМассив(ТипЗнч(УчетныеАктивы.ПустаяСсылка()))));
	СчетаУчетаПереоценки.Колонки.Добавить("СчетУчетаПереоценки", Новый ОписаниеТипов("ПланСчетовСсылка." + ?(ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, "Единый", "Основной")));
	
	Если ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		
		СтрокаТаблицы = СчетаУчетаПереоценки.Добавить();
		СтрокаТаблицы.УчетныйАктив			= УчетныеАктивы.ПроцентыНаМНО;
		СтрокаТаблицы.СчетУчетаПереоценки	= УчетныеАктивы.ПроцентыНаМНО.СчетУчетаПереоценкиА;
		Если НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.Расчеты Тогда
		    СтрокаТаблицы.СчетУчетаПереоценки	= ПланыСчетов.Единый.Расчеты23;
		ИначеЕсли НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.РасчетныеСчета Тогда
			СтрокаТаблицы.СчетУчетаПереоценки	= ПланыСчетов.Единый.РасчетныеСчета07;
		КонецЕсли;
		
		СтрокаТаблицы = СчетаУчетаПереоценки.Добавить();
		СтрокаТаблицы.УчетныйАктив			= УчетныеАктивы.ПроцентыНаСМО;
		СтрокаТаблицы.СчетУчетаПереоценки	= УчетныеАктивы.ПроцентыНаСМО.СчетУчетаПереоценкиА;
		Если НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.Расчеты Тогда
		    СтрокаТаблицы.СчетУчетаПереоценки	= ПланыСчетов.Единый.Расчеты23;
		ИначеЕсли НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.РасчетныеСчета Тогда
			СтрокаТаблицы.СчетУчетаПереоценки	= ПланыСчетов.Единый.РасчетныеСчета07;
		КонецЕсли;
		
		СтрокаТаблицы = СчетаУчетаПереоценки.Добавить();
		СтрокаТаблицы.УчетныйАктив			= УчетныеАктивы.ПроцентыНаФЕО;
		СтрокаТаблицы.СчетУчетаПереоценки	= УчетныеАктивы.ПроцентыНаФЕО.СчетУчетаПереоценкиА;
		Если НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.Расчеты Тогда
		    СтрокаТаблицы.СчетУчетаПереоценки	= ПланыСчетов.Единый.Расчеты23;
		ИначеЕсли НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.РасчетныеСчета Тогда
			СтрокаТаблицы.СчетУчетаПереоценки	= ПланыСчетов.Единый.РасчетныеСчета07;
		КонецЕсли;
		
	Иначе
		
		СтрокаТаблицы = СчетаУчетаПереоценки.Добавить();
		СтрокаТаблицы.УчетныйАктив			= УчетныеАктивы.ПроцентыНаМНО;
		СтрокаТаблицы.СчетУчетаПереоценки	= БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(ДатаПереоценки, Организация, СчетДоверительногоУправления, УчетныеАктивы.ПроцентыНаМНО, ВидУчета);
		
		СтрокаТаблицы = СчетаУчетаПереоценки.Добавить();
		СтрокаТаблицы.УчетныйАктив			= УчетныеАктивы.ПроцентыНаСМО;
		СтрокаТаблицы.СчетУчетаПереоценки	= БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(ДатаПереоценки, Организация, СчетДоверительногоУправления, УчетныеАктивы.ПроцентыНаСМО, ВидУчета);
		
		СтрокаТаблицы = СчетаУчетаПереоценки.Добавить();
		СтрокаТаблицы.УчетныйАктив			= УчетныеАктивы.ПроцентыНаФЕО;
		СтрокаТаблицы.СчетУчетаПереоценки	= БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(ДатаПереоценки, Организация, СчетДоверительногоУправления, УчетныеАктивы.ПроцентыНаФЕО, ВидУчета);
		
	КонецЕсли;
	
	// Проверка заполнения счетов переоценки
	
	Для Каждого СтрокаТаблицы Из СчетаУчетаПереоценки Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаПереоценки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не определён счет учета переоценки актива '%1' для вида учета '%2'", СтрокаТаблицы.УчетныйАктив, ВидУчета), , , , Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СчетаУчетаПереоценки;
		
КонецФункции

Функция ТребуетсяПереоценка(Организация, СчетДоверительногоУправления, ВидУчета, УчетныйАктив, ДатаПереоценки) Экспорт
	
	Переоценивать = Ложь;
	
	КалендарьДляСчетаДУ = РаботаСПереоценкой.ПолучитьКалендарьДляСчетаДУ(Организация, СчетДоверительногоУправления, ДатаПереоценки);
	
	РабочийДень = Справочники.Календари.ЭтоРабочийДень(КалендарьДляСчетаДУ, ДатаПереоценки);
	
	ПериодичностьПереоценки	= БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(ДатаПереоценки, Организация, СчетДоверительногоУправления, УчетныйАктив, ВидУчета, "ПериодичностьПереоценки");
	ПереоцениватьВНерабочиеДни = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(ДатаПереоценки, Организация, СчетДоверительногоУправления, УчетныйАктив, ВидУчета, "ПереоцениватьВНерабочиеДни");

	Если ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
		Если ДатаПереоценки = НачалоДня(КонецМесяца(ДатаПереоценки)) Тогда
		    Переоценивать = Истина;
		ИначеЕсли РабочийДень Тогда
			Переоценивать = Истина;
		ИначеЕсли ПереоцениватьВНерабочиеДни Тогда
			Переоценивать = Истина;
		КонецЕсли;
	ИначеЕсли БухгалтерскийУчетЕПС.ПроверкаНеобходимостиПереоценки(ПериодичностьПереоценки, ДатаПереоценки, КалендарьДляСчетаДУ) Тогда
		Переоценивать = Истина;
	КонецЕсли;

	Возврат Переоценивать;	
	
КонецФункции
